[
  {
    "name": "Barbell Squat",
    "description": "Raja dari semua latihan kaki. Gerakan fundamental untuk membangun kekuatan dan massa di seluruh tubuh bagian bawah.",
    "bodyPart": "legs",
    "equipment": "barbell",
    "gifUrl": "https://github.com/yuhonas/free-exercise-db/raw/main/exercises/barbell-squat.gif",
    "primaryMuscles": ["quadriceps", "glutes"],
    "secondaryMuscles": ["hamstrings", "calves", "lower_back"],
    "instructions": [
      "Letakkan barbell di punggung atas Anda, berdiri dengan kaki selebar bahu.",
      "Jaga dada tetap tegak dan punggung lurus, turunkan pinggul ke belakang dan ke bawah seolah-olah duduk di kursi.",
      "Turun hingga paha Anda setidaknya sejajar dengan lantai.",
      "Dorong kembali ke posisi awal melalui tumit."
    ]
  },
  {
    "name": "Barbell Bench Press",
    "description": "Latihan utama untuk membangun kekuatan dan ukuran otot dada, bahu depan, dan trisep.",
    "bodyPart": "chest",
    "equipment": "barbell",
    "gifUrl": "https://github.com/yuhonas/free-exercise-db/raw/main/exercises/barbell-bench-press.gif",
    "primaryMuscles": ["chest"],
    "secondaryMuscles": ["shoulders", "triceps"],
    "instructions": [
      "Berbaring telentang di bangku datar, pegang barbell dengan genggaman sedikit lebih lebar dari bahu.",
      "Turunkan barbell secara perlahan ke tengah dada Anda, jaga siku tetap terkontrol.",
      "Dorong barbell kembali ke atas dengan kuat hingga lengan hampir lurus."
    ]
  },
  {
    "name": "Lat Pulldown",
    "description": "Alternatif yang bagus untuk pull-up, menargetkan otot punggung (latissimus dorsi) untuk membangun punggung yang lebar.",
    "bodyPart": "back",
    "equipment": "cable machine",
    "gifUrl": "https://github.com/yuhonas/free-exercise-db/raw/main/exercises/lat-pulldown.gif",
    "primaryMuscles": ["lats"],
    "secondaryMuscles": ["biceps", "traps"],
    "instructions": [
      "Duduk di mesin dan kencangkan penahan paha.",
      "Pegang palang dengan genggaman lebar, telapak tangan menghadap ke depan.",
      "Tarik palang ke bawah hingga menyentuh dada bagian atas, jaga punggung tetap lurus dan dada dibusungkan.",
      "Kembalikan palang ke posisi awal secara perlahan."
    ]
  },
  {
    "name": "Dumbbell Shoulder Press",
    "description": "Latihan yang sangat baik untuk membangun kekuatan dan massa pada otot bahu (deltoid).",
    "bodyPart": "shoulders",
    "equipment": "dumbbell",
    "gifUrl": "https://github.com/yuhonas/free-exercise-db/raw/main/exercises/dumbbell-seated-shoulder-press.gif",
    "primaryMuscles": ["shoulders"],
    "secondaryMuscles": ["triceps"],
    "instructions": [
      "Duduk di bangku dengan sandaran tegak, pegang dumbbell setinggi bahu dengan telapak tangan menghadap ke depan.",
      "Dorong dumbbell lurus ke atas kepala hingga lengan hampir lurus.",
      "Turunkan kembali dumbbell secara perlahan dan terkontrol ke posisi awal."
    ]
  },
  {
    "name": "Tricep Dips",
    "description": "Latihan bodyweight yang efektif untuk menargetkan otot trisep dan dada bagian bawah.",
    "bodyPart": "triceps",
    "equipment": "bodyweight",
    "gifUrl": "https://github.com/yuhonas/free-exercise-db/raw/main/exercises/tricep-dips.gif",
    "primaryMuscles": ["triceps"],
    "secondaryMuscles": ["chest", "shoulders"],
    "instructions": [
      "Pegang palang paralel dengan lengan lurus dan tubuh tegak.",
      "Tekuk siku untuk menurunkan tubuh secara perlahan hingga bahu sejajar dengan siku.",
      "Dorong tubuh kembali ke atas dengan kekuatan trisep hingga lengan lurus kembali."
    ]
  },
  {
    "name": "Leg Press",
    "description": "Latihan mesin yang memungkinkan Anda mengangkat beban berat untuk melatih paha depan, hamstring, dan bokong.",
    "bodyPart": "legs",
    "equipment": "machine",
    "gifUrl": "https://github.com/yuhonas/free-exercise-db/raw/main/exercises/leg-press.gif",
    "primaryMuscles": ["quadriceps", "glutes"],
    "secondaryMuscles": ["hamstrings", "calves"],
    "instructions": [
      "Duduk di mesin dengan punggung dan kepala menempel pada sandaran.",
      "Letakkan kaki di platform selebar bahu.",
      "Dorong platform ke atas hingga kaki hampir lurus, lalu lepaskan kunci pengaman.",
      "Turunkan platform secara perlahan dengan menekuk lutut."
    ]
  },
  {
    "name": "Push-up",
    "description": "Latihan fundamental untuk kekuatan tubuh bagian atas, terutama dada, bahu, dan trisep.",
    "bodyPart": "chest",
    "equipment": "bodyweight",
    "gifUrl": "https://github.com/yuhonas/free-exercise-db/raw/main/exercises/push-up.gif",
    "primaryMuscles": ["chest"],
    "secondaryMuscles": ["shoulders", "triceps"],
    "instructions": [
      "Mulai dengan posisi plank, tangan sedikit lebih lebar dari bahu.",
      "Jaga tubuh tetap lurus dari kepala hingga tumit.",
      "Turunkan tubuh hingga dada hampir menyentuh lantai.",
      "Dorong tubuh kembali ke posisi awal dengan kekuatan dada dan trisep."
    ]
  },
  {
    "name": "Pull Up",
    "description": "Latihan bodyweight terbaik untuk membangun lebar dan kekuatan punggung (lats).",
    "bodyPart": "back",
    "equipment": "bodyweight",
    "gifUrl": "https://github.com/yuhonas/free-exercise-db/raw/main/exercises/pull-up.gif",
    "primaryMuscles": ["lats", "biceps"],
    "secondaryMuscles": ["forearms", "shoulders"],
    "instructions": [
      "Genggam palang dengan telapak tangan menghadap ke depan (overhand grip), sedikit lebih lebar dari bahu.",
      "Mulai dari posisi menggantung dengan lengan lurus.",
      "Tarik tubuh ke atas hingga dagu melewati palang, fokus pada otot punggung.",
      "Turunkan tubuh secara perlahan dan terkontrol."
    ]
  },
  {
    "name": "Dumbbell Bicep Curl",
    "description": "Gerakan klasik dan paling populer untuk melatih otot bisep lengan depan.",
    "bodyPart": "biceps",
    "equipment": "dumbbell",
    "gifUrl": "https://github.com/yuhonas/free-exercise-db/raw/main/exercises/dumbbell-bicep-curl.gif",
    "primaryMuscles": ["biceps"],
    "secondaryMuscles": ["forearms"],
    "instructions": [
      "Pegang sepasang dumbbell di sisi tubuh dengan telapak tangan menghadap ke depan.",
      "Jaga siku tetap di sisi tubuh, angkat dumbbell secara perlahan ke arah bahu.",
      "Kontraksikan otot bisep di puncak gerakan, lalu turunkan kembali dumbbell dengan terkontrol."
    ]
  },
  {
    "name": "Plank",
    "description": "Latihan isometrik fundamental untuk membangun kekuatan dan stabilitas otot inti (core).",
    "bodyPart": "abs",
    "equipment": "bodyweight",
    "gifUrl": "https://github.com/yuhonas/free-exercise-db/raw/main/exercises/plank.gif",
    "primaryMuscles": ["abs"],
    "secondaryMuscles": ["obliques", "lower_back"],
    "instructions": [
      "Mulai dengan posisi push-up, tetapi bertumpu pada lengan bawah (forearm) bukan telapak tangan.",
      "Pastikan tubuh membentuk garis lurus dari kepala hingga tumit.",
      "Kencangkan otot perut dan bokong, lalu tahan posisi ini selama mungkin."
    ]
  },
  {
    "name": "Deadlift",
    "description": "Latihan seluruh tubuh yang sangat baik untuk membangun kekuatan punggung bawah, bokong, dan hamstring.",
    "bodyPart": "back",
    "equipment": "barbell",
    "gifUrl": "https://github.com/yuhonas/free-exercise-db/raw/main/exercises/barbell-deadlift.gif",
    "primaryMuscles": ["lower_back", "glutes", "hamstrings"],
    "secondaryMuscles": ["quadriceps", "traps", "forearms"],
    "instructions": [
      "Berdiri dengan bagian tengah kaki di bawah barbell.",
      "Tekuk pinggul dan lutut untuk memegang barbell dengan punggung lurus.",
      "Angkat barbell dengan mendorong melalui tumit hingga berdiri tegak.",
      "Turunkan barbell dengan mengontrol gerakan, tekuk pinggul dan lutut."
    ]
  },
  {
    "name": "Crunches",
    "description": "Latihan perut klasik untuk menargetkan otot rektus abdominis bagian atas.",
    "bodyPart": "abs",
    "equipment": "bodyweight",
    "gifUrl": "https://github.com/yuhonas/free-exercise-db/raw/main/exercises/crunches.gif",
    "primaryMuscles": ["abs"],
    "secondaryMuscles": [],
    "instructions": [
      "Berbaring telentang dengan lutut ditekuk dan kaki rata di lantai.",
      "Letakkan tangan di belakang kepala atau menyilang di dada.",
      "Angkat kepala dan bahu dari lantai dengan mengontraksikan otot perut.",
      "Turunkan kembali secara perlahan."
    ]
  }
]